app/Views/Admin/produkprice.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
        foreach ($data as $key => $item) {

          $model = new ModelUsers();
          $nameUser = $model->where('id', $item['create_by'])->first();