app/Views/Admin/produk.php

            <td>
              <?php
              $model = new ModelUsers();
              $nameUser = $model->where('id', $item['created_by'])->findAll();
---
SELECT *
FROM `users`
WHERE `id` = '1'