app/Views/Admin/Layout/Script.php

            use App\Models\ModelUsers;

            $model = new ModelUsers();
            $nameUser = $model->where('id', 1)->findAll();
---
SELECT *
FROM `users`
WHERE `id` = 1

            $('#eventinfo_image').attr('src', image);
            <?php
            $model = new ModelUsers();
            $nameUser = $model->where('id', 1)->findAll();
---
SELECT *
FROM `users`
WHERE `id` = 1

            $('#itinfopost_image').attr('src', image);
            <?php
            $model = new ModelUsers();
            $nameUser = $model->where('id', 1)->findAll();
---
SELECT *
FROM `users`
WHERE `id` = 1