app/Controllers/Page.php

function settingValues($cari)
{
    $model = new ModelSetting();
    return $model->where('setting_variable', $cari)->findall()[0]['setting_value'];
---
SELECT *
FROM `settings`
WHERE `setting_variable` = 'logo'

function sessions($page)
{
    $session = session();
    if ($session->get('name') == null) {
        return null;
    } else {
        $data['id'] = $session->get('id');
        $data['name'] = $session->get('name');
        $data['type'] = $session->get('type');
        $data['page'] = $page;
        $modelmcategory = new ModelMCategory();
        $data['mcategories'] = $modelmcategory->orderBy('id', 'DESC')->findAll();
        $modelmtag = new ModelMTags();
        $data['mtags'] = $modelmtag->orderBy('id', 'DESC')->findAll();
        $data['setting_logo'] = settingValues('logo');
        $data['setting_title'] = settingValues('title');
        $modelStaff = new ModelOrganization();
        $data['atasan'] = $modelStaff->join('employees', 'organization.person = employees.id')->where('name', 'kabid')->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `categories`
ORDER BY `id` DESC
SELECT *
FROM `tags`
ORDER BY `id` DESC
SELECT *
FROM `organization`
JOIN `employees` ON `organization`.`person` = `employees`.`id`
WHERE `name` = 'kabid'
ORDER BY `id` DESC

    public function wisata()
    {
        try {
            $data = sessions('Produk');
            if ($data == null) {
                out();
                return redirect()->to('/login');
            } else {
                $model = new ModelProduk();
                $data['data'] = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `produk`
ORDER BY `created_at` DESC

    public function produk()
    {
        try {
            $data = sessions('Produk');
            if ($data == null) {
                out();
                return redirect()->to('/login');
            } else {
                $model = new ModelProdukPrice();
                $data['data'] = $model->where('idProduk', $_POST['id'])->orderBy('id', 'DESC')->findAll();
                $modelproduk = new modelproduk();
                $data['produk'] = $modelproduk->where('id', $_POST['id'])->first();
---
SELECT *
FROM `produk`
WHERE `id` = '1'
 LIMIT 1

    public function logs()
    {
        try {
            $data = sessions('Aktivitas');
            if ($data == null) {
                out();
                return redirect()->to('/login');
            } else {
                $model = new ModelLogs();
                $data['data'] = $model->orderBy('timestamp', 'DESC')->findAll();
---
SELECT *
FROM `logs`
ORDER BY `timestamp` DESC